Revit 2027 API
FilterCategoryRule.SetCategories Method
 Sets the rule's categories.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool SetCategories(
	ICollection<ElementId> categories
)
Public Function SetCategories (
	categories As ICollection(Of ElementId)
) As Boolean
public:
bool SetCategories(
	ICollection<ElementId^>^ categories
)
member SetCategories :
        categories : ICollection<ElementId> -> bool
Parameters
categories ICollection<ElementId>
 The categories.
Return Value
Boolean
 True if the set of categories was changed, false if no change was necessary.
Exceptions
Exception | Condition
ArgumentException |  One of the given categories is not filterable
ArgumentNullException |  A non-optional argument was null
See Also
Reference
FilterCategoryRule Class
Autodesk.Revit.DB Namespace